# Insert Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ProjectLocationSet..::..Insert Method
ProjectLocationSet Class See Also
---
Insert the specified project location into the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool Insert(
	ProjectLocation item
)
```

Visual Basic
---
```text
Public Overridable Function Insert ( _
	item As ProjectLocation _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Insert(
	ProjectLocation^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..ProjectLocationThe project location to be inserted into the set.
# ### Return Value
Returns whether the project location was inserted into the set.
# See Also
ProjectLocationSet Class
Autodesk.Revit.DB Namespace